src/cfe/МенеджерСинхронизаций/Catalogs/МС_НастройкиAPI.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>МС_НастройкиAPI</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВерсияAPI</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>3</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПараметрURL</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>HTTPМетод</Name>
					<Type>
						<v8:Type>cfg:EnumRef.МС_HTTPМетодAPI</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Активно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособПолученияДанных</Name>
					<Type>
						<v8:Type>cfg:EnumRef.МС_СпособПолученияДанныхAPI</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстЗапроса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяМетодаОбработчика</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонструкторТипИсточника</Name>
					<Type>
						<v8:Type>cfg:EnumRef.МС_ТипИсточникаКонструктораAPI</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонструкторИмяОбъекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонструкторИмяТабличнойЧасти</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонструкторИмяТаблицы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонструкторВиртуальнаяТаблица</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонструкторПараметрПериода</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонструкторПоля</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонструкторОтборыJSON</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФорматОтвета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.МС_ФорматОтветаAPI</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛимитСтрок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>JSONПараметрыЗаписи</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПараметрыЗапроса</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяПараметра</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Обязательный</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипПараметра</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>30</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Источник</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Описание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СпособСопоставления</Name>
							<Type>
								<v8:Type>cfg:EnumRef.МС_СпособСопоставленияПараметраОтбора</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ТестовыеЗначенияПараметров</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяПараметра</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cfe/МенеджерСинхронизаций/Catalogs/МС_НастройкиAPI/Ext/ObjectModule.bsl
#Если Сервер Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)

	Если Не ЗначениеЗаполнено(HTTPМетод) Тогда
		HTTPМетод = Перечисления.МС_HTTPМетодAPI.GET;
	КонецЕсли;
	Если Не ЗначениеЗаполнено(ФорматОтвета) Тогда
		ФорматОтвета = Перечисления.МС_ФорматОтветаAPI.JSON;
	КонецЕсли;
	Если Не ЗначениеЗаполнено(СпособПолученияДанных) Тогда
		СпособПолученияДанных = Перечисления.МС_СпособПолученияДанныхAPI.ТекстЗапроса;
	КонецЕсли;
	Если Не ЗначениеЗаполнено(КонструкторТипИсточника) Тогда
		КонструкторТипИсточника = Перечисления.МС_ТипИсточникаКонструктораAPI.Справочник;
	КонецЕсли;

КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)

	Если СпособПолученияДанных = Перечисления.МС_СпособПолученияДанныхAPI.ТекстЗапроса Тогда
		ПроверяемыеРеквизиты.Добавить("ТекстЗапроса");
	КонецЕсли;
	Если СпособПолученияДанных = Перечисления.МС_СпособПолученияДанныхAPI.ПрограммныйМодуль Тогда
		ПроверяемыеРеквизиты.Добавить("ИмяМетодаОбработчика");
	КонецЕсли;
	Если СпособПолученияДанных = Перечисления.МС_СпособПолученияДанныхAPI.Конструктор Тогда
		ПроверяемыеРеквизиты.Добавить("КонструкторИмяОбъекта");
	КонецЕсли;

КонецПроцедуры

Процедура ПередЗаписью(Отказ)

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	ВерсияAPI = СокрЛП(ВерсияAPI);
	ПараметрURL = СокрЛП(ПараметрURL);

	ПроверитьСегментURL(ВерсияAPI, "ВерсияAPI", "Версия API", Отказ);
	ПроверитьСегментURL(ПараметрURL, "ПараметрURL", "Параметр URL", Отказ);
	ПроверитьУникальностьАдреса(Отказ);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ПроверитьСегментURL(Значение, ИмяРеквизита, Представление, Отказ)
	
	// Значение - сегмент адреса API, поэтому разделители адреса и пробелы в нем недопустимы.

	НедопустимыеСимволы = "/\?#&%= ";
	Для Индекс = 1 По СтрДлина(НедопустимыеСимволы) Цикл
		Если СтрНайти(Значение, Сред(НедопустимыеСимволы, Индекс, 1)) > 0 Тогда
			ТекстСообщения = СтрШаблон(
				"Поле ""%1"" не должно содержать символы / \ ? # & %% = и пробелы: значение является частью адреса API.",
				Представление);
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, ИмяРеквизита, "Объект", Отказ);
			Возврат;
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

Процедура ПроверитьУникальностьАдреса(Отказ)
	
	// Сравнение без учета регистра - так же, как настройка ищется при обработке HTTP-запроса.

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Спр.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.МС_НастройкиAPI КАК Спр
	|ГДЕ
	|	ВРЕГ(Спр.ВерсияAPI) = &ВерсияAPI
	|	И ВРЕГ(Спр.ПараметрURL) = &ПараметрURL
	|	И Спр.HTTPМетод = &HTTPМетод
	|	И Спр.Ссылка <> &Ссылка";
	Запрос.УстановитьПараметр("ВерсияAPI", ВРег(ВерсияAPI));
	Запрос.УстановитьПараметр("ПараметрURL", ВРег(ПараметрURL));
	Запрос.УстановитьПараметр("HTTPМетод", HTTPМетод);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);

	Если Не Запрос.Выполнить().Пустой() Тогда
		ОбщегоНазначения.СообщитьПользователю(
			"Настройка с такой комбинацией версии API, имени шаблона URL и HTTP-метода уже существует.",
			ЭтотОбъект, "ПараметрURL", "Объект", Отказ);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
